print('Задача 1. Кубы чисел')

# Любителю математики Паше снова стало мало распечатанных табличек,
# включая последнюю со степенями двойки.
# Теперь он хочет взять третью степень чисел от 1 до абсолютно любого!

# Напишите программу,
# которая возводит в третью степень каждое число от 1 до N
# и выводит результат на экран.
number = int(input('Введите число: '))
while number > 0:
  rate = number ** 3
  print('Число', number, 'в третьей степени равно', rate)
  number = int(input('Введите число: '))
print('Вы ввели число меньше 1')